classes/subclasses/con_man.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-17 Mon 16:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Con man</title>
<meta name="author" content="zfoteff" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../static/stylesheets/subclass-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Con man</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5a6a3f2">1. Level 1</a></li>
<li><a href="#org8491856">2. Level 2</a></li>
<li><a href="#org34501d9">3. Level 5</a></li>
<li><a href="#org50c4022">4. Level 10</a></li>
<li><a href="#org3c10b57">5. Level 15</a></li>
<li><a href="#org1b1401f">6. Level 19</a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
[<a href="../../dnd.html#ID-DND">Main Menu</a>] [<a href="../classes.html#ID-campaign-classes">Character Selection</a>] [<a href="../classes.html#ID-campaign-classes">Classes</a>] [<a href="../rogue.html#ID-7e784143-655d-4170-af49-68aceea59caa">Rogue</a>]
</p>
</div>
<hr />
<p>
Use tricks and your unwavering confidence to talk your way into any party, and out of every fight.
</p>

<p>
This class is going to role-play heavy, it will require a lot of improvisation on the player&rsquo;s part
</p>

<p>
Start with:
</p>
<ul class="org-ul">
<li>A dice set or a playing card set</li>
<li>A forgery kit</li>
</ul>

<div id="outline-container-org5a6a3f2" class="outline-2">
<h2 id="org5a6a3f2"><span class="section-number-2">1.</span> Level 1</h2>
<div class="outline-text-2" id="text-1">
<p>
Gain Striking Looks: You are a stunning individual, and your social skills are unmatched. You gain a +2 bonus to all deception and persuasion rolls. You also gain +2 bonus to performance if you are in front of a crowd.
</p>
</div>
</div>
<div id="outline-container-org8491856" class="outline-2">
<h2 id="org8491856"><span class="section-number-2">2.</span> Level 2</h2>
<div class="outline-text-2" id="text-2">
<p>
Gain Silver Tongue: You&rsquo;re conversational skills are unmatched and you can easily deceive others. You can select a target in combat and make a Deception check contested by the target&rsquo;s Insight. If your check succeeds: any attack the targeted creature makes against you is made with disadvantage. Any attack or ability check you make against the target is made with advantage. If the check fails, the target cannot be deceived this way for one hour.
</p>

<p>
Gain Gambits: You develop special <a href="../../../gambits.html#ID-1a4c073a-78f7-4500-899b-fccc59a1dcf0">gambits</a> to help your criminal endeavors. You learn 2 gambits initially, and you can gain more as you gain levels in the class. Every time you learn a new gambit, you can replace one gambit you know for a new one.
</p>
</div>
</div>
<div id="outline-container-org34501d9" class="outline-2">
<h2 id="org34501d9"><span class="section-number-2">3.</span> Level 5</h2>
<div class="outline-text-2" id="text-3">
<p>
Gain Smart Talker: You can add your Intelligence modifier as a bonus to any Charisma check you make.
</p>

<p>
Gain Advanced Silver Tongue: You hone your conversational skills so that you can use Silver Tongue outside of combat. If the check passes: you have the ability to make any humanoid who is neither hostile, nor friendly to you now be considered friendly. If the check fails: the target cannot be deceived this way for a minute, rather than an hour.
</p>
</div>
</div>

<div id="outline-container-org50c4022" class="outline-2">
<h2 id="org50c4022"><span class="section-number-2">4.</span> Level 10</h2>
<div class="outline-text-2" id="text-4">
<p>
Gain +2 to Charisma.
</p>

<p>
You are now capable of learning 3 gambits.
</p>

<p>
Gain Distraction: You can distract one target who you can see and can see you. Make a Performance/Deception/Persuasion check contested by the targets Insight. If the check success: you can gain the target&rsquo;s attention long enough so that it has to make a Perception check to escape your distraction, and all target actions are disadvantaged.
</p>
</div>
</div>
<div id="outline-container-org3c10b57" class="outline-2">
<h2 id="org3c10b57"><span class="section-number-2">5.</span> Level 15</h2>
<div class="outline-text-2" id="text-5">
<p>
Gain Magnetic Personality: You can now attract crowds of people to follow you. You may attract a crowd equal to 2 times your charisma modifier who will serve you loyally and even fight for you, at no cost besides basic lifestyle expenses <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>

<p>
Gain Long Sleep: You instantly kill sleeping targets, unless they are extremely powerful, in which case confer with the DM to determine an amount of damage you can deal to the target.
</p>
</div>
</div>
<div id="outline-container-org1b1401f" class="outline-2">
<h2 id="org1b1401f"><span class="section-number-2">6.</span> Level 19</h2>
<div class="outline-text-2" id="text-6">
<p>
Receive a 50% discount on all items while shopping.
</p>

<p>
Gain Cult of Personality: You can now attract more people to follow you. You may attract a crowd equal to 5 times your charisma modifier who will serve you loyally and even fight for you, at no cost besides basic lifestyle expenses <sup><a id="fnr.1.100" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>
<hr />
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
The first rule of raising an army/cult/religion/Oregon Trail wagon/militia/political party: you have to feed your followers for them to follow you. Food isn&rsquo;t free.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-15 Sat 00:00</p>
<p class="author">Author: zfoteff</p>
<p class="date">Created: 2023-07-17 Mon 16:46</p>
</div>
</body>
</html>
